mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
// cLcd
//{{{
cLcd::cLcd (uint32_t buffer0, uint32_t buffer1)  {

  mStartTime = osKernelSysTick();

  mBuffer[false] = buffer0;
  mBuffer[true] = buffer1;

  updateNumDrawLines();
  }
//}}}

// static members
//{{{
cLcd* cLcd::create (std::string title, bool buffered) {

  if (!mLcd) {
    mLcd = new cLcd (SDRAM_FRAME0, SDRAM_FRAME1);
    mLcd->init (title, buffered);
    }

  return mLcd;
  }
//}}}
//{{{
std::string cLcd::hexStr (int value, uint8_t width) {

  std::ostringstream os;
  if (width)
    os << std::hex << std::setfill ('0') << std::setw (width) << value;
  else
    os << std::hex << value;
  return os.str();
  }
//}}}
//{{{
std::string cLcd::intStr (int value, uint8_t width, char fill) {

  std::ostringstream os;
  if (width)
    os << std::setfill (fill) << std::setw (width) << value;
  else
    os << value;
  return os.str();
  }
//}}}

// public members
//{{{
void cLcd::setTitle (std::string title) {
  mTitle = title;
  updateNumDrawLines();
  }
//}}}
//{{{
void cLcd::setShowDebug (bool title, bool info, bool lcdStats, bool footer) {

  mShowTitle = title;
  mShowInfo = info;
  mShowLcdStats = lcdStats;
  mShowFooter = footer;

  updateNumDrawLines();
  }
//}}}

//{{{
void cLcd::info (uint32_t colour, std::string str, bool newLine) {

  bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

  auto line = (newLine && (mLastLine < mMaxLine-1)) ? mLastLine+1 : mLastLine;
  mLines[line].mTime = osKernelSysTick();
  mLines[line].mColour = colour;
  mLines[line].mString = str;
  if (newLine)
    mLastLine = line;

  if (tailing)
    mFirstLine = mLastLine - mNumDrawLines + 1;
  }
//}}}
//{{{
void cLcd::info (std::string str, bool newLine) {
  info (LCD_WHITE, str, newLine);
  }
//}}}
//{{{
int cLcd::string (uint32_t col, int fontHeight, std::string str, int16_t x, int16_t y, uint16_t xlen, uint16_t ylen) {

  for (unsigned int i = 0; i < str.size(); i++) {
    if ((str[i] >= 0x20) && (str[i] <= 0x7F)) {
      auto fontChar = chars[str[i] - 0x20];
      if (!fontChar) {
        FT_Set_Pixel_Sizes (FTface, 0, fontHeight);
        FT_Load_Char (FTface, str[i], FT_LOAD_RENDER);

        // cache char info
        fontChar = (tFontChar*)pvPortMalloc (sizeof(tFontChar));
        chars[str[i] - 0x20] = fontChar;
        fontChar->left = FTglyphSlot->bitmap_left;
        fontChar->top = FTglyphSlot->bitmap_top;
        fontChar->pitch = FTglyphSlot->bitmap.pitch;
        fontChar->rows = FTglyphSlot->bitmap.rows;
        fontChar->advance = FTglyphSlot->advance.x / 64;
        fontChar->bitmap = nullptr;

        if (FTglyphSlot->bitmap.buffer) {
          // cache char bitmap
          fontChar->bitmap = (uint8_t*)pvPortMalloc (FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
          memcpy (fontChar->bitmap, FTglyphSlot->bitmap.buffer, FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
          }
        }

      if (x + fontChar->left + fontChar->pitch >= xlen)
        break;
      else if (fontChar->bitmap)
        stamp (col, fontChar->bitmap, x + fontChar->left, y + fontHeight - fontChar->top, fontChar->pitch, fontChar->rows);

      x += fontChar->advance;
      }
    }

  return x;
  }
//}}}

//{{{
void cLcd::press (int pressCount, int x, int y, int z, int xinc, int yinc) {

  if ((pressCount > 30) && (x <= mStringPos) && (y <= getLineHeight()))
    reset();
  else if (pressCount == 0) {
    if (x <= mStringPos) {
      // set displayFirstLine
      if (y < 2 * getLineHeight())
        displayTop();
      else if (y > getHeight() - 2 * getLineHeight())
        displayTail();
      }
    }
  else {
    // inc firstLine
    float value = mFirstLine - ((2.0f * yinc) / getLineHeight());

    if (value < 0)
      mFirstLine = 0;
    else if (mLastLine <= (int)mNumDrawLines-1)
      mFirstLine = 0;
    else if (value > mLastLine - mNumDrawLines + 1)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    else
      mFirstLine = value;
    }
  }
//}}}

//{{{
void cLcd::pixel (uint32_t col, int16_t x, int16_t y) {

  if (mBuffered)
    rect (col, x, y, 1, 1);
  else
    *(uint32_t*)(curFrameBufferAddress + (y*getWidth() + x)*4) = col;
  }
//}}}
//{{{
void cLcd::pixelClipped (uint32_t col, int16_t x, int16_t y) {

    rectClipped (col, x, y, 1, 1);
  }
//}}}
//{{{
void cLcd::rect (uint32_t col, int16_t x, int16_t y, uint16_t xlen, uint16_t ylen) {

  if (!xlen)
    return;
  if (!ylen)
    return;

  if (mBuffered) {
    *mDma2dCurBuf++ = col;                                                // colour
    *mDma2dCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4; // fb start address
    *mDma2dCurBuf++ = getWidth() - xlen;                                  // stride
    *mDma2dCurBuf++ = (xlen << 16) | ylen;                                // xlen:ylen
    *mDma2dCurBuf++ = 0;                                                  // terminate
    *(mDma2dCurBuf-6) = 1;                                                // fill opCode

    if (mDma2dCurBuf > mDma2dHighWater)
      mDma2dHighWater = mDma2dCurBuf;
    }

  else {
    DMA2D->OCOLR = col;
    DMA2D->OMAR  = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
    DMA2D->OOR   = getWidth() - xlen;
    DMA2D->NLR   = (xlen << 16) | ylen;
    DMA2D->CR = DMA2D_CR_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    while (!(DMA2D->ISR & DMA2D_ISR_TCIF)) {}
    DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                   DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
    }

  }
//}}}
//{{{
void cLcd::rectClipped (uint32_t col, int16_t x, int16_t y, uint16_t xlen, uint16_t ylen) {

  if (x >= getWidth())
    return;
  if (y >= getHeight())
    return;

  int xend = x + xlen;
  if (xend <= 0)
    return;

  int yend = y + ylen;
  if (yend <= 0)
    return;

  if (x < 0)
    x = 0;
  if (xend > getWidth())
    xend = getWidth();

  if (y < 0)
    y = 0;
  if (yend > getHeight())
    yend = getHeight();

  rect (col, x, y, xend - x, yend - y);
  }
//}}}
//{{{
void cLcd::rectOutline (uint32_t col, int16_t x, int16_t y, uint16_t xlen, uint16_t ylen) {

  rectClipped (col, x, y, xlen, 1);
  rectClipped (col, x + xlen, y, 1, ylen);
  rectClipped (col, x, y + ylen, xlen, 1);
  rectClipped (col, x, y, 1, ylen);
  }
//}}}
//{{{
void cLcd::clear (uint32_t col) {

  rect (col, 0, 0, getWidth(), getHeight());
  }
//}}}
//{{{
void cLcd::ellipse (uint32_t col, int16_t x, int16_t y, uint16_t xradius, uint16_t yradius) {

  if (!xradius)
    return;
  if (!yradius)
    return;

  int x1 = 0;
  int y1 = -yradius;
  int err = 2 - 2*xradius;
  float k = (float)yradius / xradius;

  do {
    rectClipped (col, (x-(uint16_t)(x1 / k)), y + y1, (2*(uint16_t)(x1 / k) + 1), 1);
    rectClipped (col, (x-(uint16_t)(x1 / k)), y - y1, (2*(uint16_t)(x1 / k) + 1), 1);

