mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
    int e2 = err;
    if (e2 <= x1) {
      err += ++x1 * 2 + 1;
      if (-y1 == x && e2 <= y1)
        e2 = 0;
      }
    if (e2 > y1)
      err += ++y1*2 + 1;
    } while (y1 <= 0);
  }
//}}}
//{{{
void cLcd::ellipseOutline (uint32_t col, int16_t x, int16_t y, uint16_t xradius, uint16_t yradius) {

  if (xradius && yradius) {
    int x1 = 0;
    int y1 = -yradius;
    int err = 2 - 2*xradius;
    float k = (float)yradius / xradius;

    do {
      rectClipped (col, x - (uint16_t)(x1 / k), y + y1, 1, 1);
      rectClipped (col, x + (uint16_t)(x1 / k), y + y1, 1, 1);
      rectClipped (col, x + (uint16_t)(x1 / k), y - y1, 1, 1);
      rectClipped (col, x - (uint16_t)(x1 / k), y - y1, 1, 1);

      int e2 = err;
      if (e2 <= x1) {
        err += ++x1*2 + 1;
        if (-y1 == x1 && e2 <= y1)
          e2 = 0;
        }
      if (e2 > y1)
        err += ++y1*2 + 1;
      } while (y1 <= 0);
    }
  }
//}}}
//{{{
void cLcd::line (uint32_t col, int16_t x1, int16_t y1, int16_t x2, int16_t y2) {

  int16_t deltax = ABS(x2 - x1);        /* The difference between the x's */
  int16_t deltay = ABS(y2 - y1);        /* The difference between the y's */
  int16_t x = x1;                       /* Start x off at the first pixel */
  int16_t y = y1;                       /* Start y off at the first pixel */

  int16_t xinc1;
  int16_t xinc2;
  if (x2 >= x1) {               /* The x-values are increasing */
    xinc1 = 1;
    xinc2 = 1;
    }
  else {                         /* The x-values are decreasing */
    xinc1 = -1;
    xinc2 = -1;
    }

  int yinc1;
  int yinc2;
  if (y2 >= y1) {                 /* The y-values are increasing */
    yinc1 = 1;
    yinc2 = 1;
    }
  else {                         /* The y-values are decreasing */
    yinc1 = -1;
    yinc2 = -1;
    }

  int den = 0;
  int num = 0;
  int num_add = 0;
  int num_pixels = 0;
  if (deltax >= deltay) {        /* There is at least one x-value for every y-value */
    xinc1 = 0;                  /* Don't change the x when numerator >= denominator */
    yinc2 = 0;                  /* Don't change the y for every iteration */
    den = deltax;
    num = deltax / 2;
    num_add = deltay;
    num_pixels = deltax;         /* There are more x-values than y-values */
    }
  else {                         /* There is at least one y-value for every x-value */
    xinc2 = 0;                  /* Don't change the x for every iteration */
    yinc1 = 0;                  /* Don't change the y when numerator >= denominator */
    den = deltay;
    num = deltay / 2;
    num_add = deltax;
    num_pixels = deltay;         /* There are more y-values than x-values */
  }

  for (int curpixel = 0; curpixel <= num_pixels; curpixel++) {
    rectClipped (col, x, y, 1, 1);   /* Draw the current pixel */
    num += num_add;                            /* Increase the numerator by the top of the fraction */
    if (num >= den) {                          /* Check if numerator >= denominator */
      num -= den;                             /* Calculate the new numerator value */
      x += xinc1;                             /* Change the x as appropriate */
      y += yinc1;                             /* Change the y as appropriate */
      }
    x += xinc2;                               /* Change the x as appropriate */
    y += yinc2;                               /* Change the y as appropriate */
    }
  }
//}}}

//{{{
void cLcd::startDraw() {

  if (mBuffered) {
    mDrawBuffer = !mDrawBuffer;
    setLayer (0, mBuffer[mDrawBuffer]);

    // frameSync;
    ltdc.frameWait = 1;
    if (osSemaphoreWait (ltdc.sem, 100) != osOK)
      ltdc.timeouts++;
    }

  mDrawStartTime = osKernelSysTick();
  }
//}}}
//{{{
void cLcd::drawCursor (uint32_t colour, int16_t x, int16_t y, int16_t z) {
  ellipse (colour, x, y, z, z);
  }
//}}}
//{{{
void cLcd::endDraw() {

  auto y = 0;
  if (mShowTitle && !mTitle.empty()) {
    //{{{  draw title
    string (LCD_WHITE, getFontHeight(), mTitle, 0, y, getWidth(), getLineHeight());
    y += getLineHeight();
    }
    //}}}
  if (mShowInfo) {
    //{{{  draw info lines
    if (mLastLine >= 0) {
      // draw scroll bar
      auto yorg = getLineHeight() + ((int)mFirstLine * mNumDrawLines * getLineHeight() / (mLastLine + 1));
      auto ylen = mNumDrawLines * mNumDrawLines * getLineHeight() / (mLastLine + 1);
      rectClipped (LCD_YELLOW, 0, yorg, 8, ylen);
      }

    auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
    if (lastLine > mLastLine)
      lastLine = mLastLine;
    for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
      auto x = 0;
      auto xinc = string (LCD_GREEN, getFontHeight(),
                          intStr ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
                          intStr ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'), x, y, getWidth(), getLineHeight());
      x += xinc + 3;
      string (mLines[lineIndex].mColour, getFontHeight(), mLines[lineIndex].mString, x, y, getWidth(), getLineHeight());
      y += getLineHeight();
      }
    }
    //}}}
  if (mShowLcdStats) {
    //{{{  draw lcdStats
    std::string str = intStr (ltdc.lineIrq) + ":f " +
                      intStr (ltdc.lineTicks) + "ms " +
                      intStr (mDma2dHighWater-mDma2dBuf) + ":hi " +
                      intStr (mDma2dTimeouts) + " " +
                      intStr (ltdc.transferErrorIrq) + " " +
                      intStr (ltdc.fifoUnderunIrq);
    string (LCD_WHITE, getFontHeight(), str, 0, getHeight() - 2 * getLineHeight(), getWidth(), 24);
    }
    //}}}
  if (mShowFooter)
    //{{{  draw footer
    string (LCD_YELLOW, getFontHeight(),
            intStr (xPortGetFreeHeapSize()) + " " + intStr (osGetCPUUsage()) + "% " + intStr (mDrawTime) + "ms",
            0, getHeight()-getLineHeight(), getWidth(), getLineHeight());
    //}}}

  sendWait();
  showLayer (0, mBuffer[mDrawBuffer], 255);

  mDrawTime = osKernelSysTick() - mDrawStartTime;
  }
//}}}
//{{{
void cLcd::draw() {

  if (!mBuffered) {
    mDrawStartTime = osKernelSysTick();
    clear (LCD_BLACK);
    endDraw();
    }
  }
//}}}

