mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
    ltdc.timeouts = 0;
    ltdc.lineIrq = 0;
    ltdc.fifoUnderunIrq = 0;
    ltdc.transferErrorIrq = 0;
    ltdc.lastTicks = 0;
    ltdc.lineTicks = 0;
    ltdc.frameWait = 0;

    HAL_NVIC_SetPriority (LTDC_IRQn, 0xE, 0);
    HAL_NVIC_EnableIRQ (LTDC_IRQn);

    // set line interupt line number
    LTDC->LIPCR = 0;

    // enable line interrupt
    LTDC->IER |= LTDC_IT_LI;
    }
    //}}}
  }
//}}}
//{{{
void cLcd::layerInit (uint8_t layer, uint32_t frameBufferAddress) {

  LTDC_LayerCfgTypeDef* curLayerCfg = &hLtdc.LayerCfg[layer];

  curLayerCfg->WindowX0 = 0;
  curLayerCfg->WindowX1 = getWidth();
  curLayerCfg->WindowY0 = 0;
  curLayerCfg->WindowY1 = getHeight();

  curLayerCfg->PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
  curLayerCfg->FBStartAdress = (uint32_t)frameBufferAddress;

  curLayerCfg->Alpha = 255;
  curLayerCfg->Alpha0 = 0;

  curLayerCfg->Backcolor.Blue = 0;
  curLayerCfg->Backcolor.Green = 0;
  curLayerCfg->Backcolor.Red = 0;

  curLayerCfg->BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
  curLayerCfg->BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;

  curLayerCfg->ImageWidth = getWidth();
  curLayerCfg->ImageHeight = getHeight();

  HAL_LTDC_ConfigLayer (&hLtdc, curLayerCfg, layer);

  // local state
  curFrameBufferAddress = frameBufferAddress;
  setFrameBufferAddress[layer] = frameBufferAddress;
  showFrameBufferAddress[layer] = frameBufferAddress;
  showAlpha[layer] = 255;
  }
//}}}
//{{{
void cLcd::setFont (const uint8_t* font, int length) {

  FT_Init_FreeType (&FTlibrary);
  FT_New_Memory_Face (FTlibrary, (FT_Byte*)font, length, 0, &FTface);
  FTglyphSlot = FTface->glyph;
  //FT_Done_Face(face);
  //FT_Done_FreeType (library);
  }
//}}}

//{{{
void cLcd::setLayer (uint8_t layer, uint32_t frameBufferAddress) {

  curFrameBufferAddress = frameBufferAddress;
  setFrameBufferAddress[layer] = frameBufferAddress;
  }
//}}}
//{{{
void cLcd::showLayer (uint8_t layer, uint32_t frameBufferAddress, uint8_t alpha) {

  showFrameBufferAddress[layer] = frameBufferAddress;
  showAlpha[layer] = alpha;
  }
//}}}

//{{{
void cLcd::stamp (uint32_t col, uint8_t* src, int16_t x, int16_t y, uint16_t xlen, uint16_t ylen) {

  if (xlen && ylen) {
    if (y + ylen > getHeight()) // bottom yclip
      ylen = getHeight() - y;

    if (mBuffered) {
      *mDma2dCurBuf++ = col;                                                    // colour
      *mDma2dCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4;  // bgnd fb start address
      *mDma2dCurBuf++ = getWidth() - xlen;                                   // stride
      *mDma2dCurBuf++ = (xlen << 16) | ylen;                                    // xlen:ylen
      *mDma2dCurBuf++ = (uint32_t)src;                                          // src start address
      *mDma2dCurBuf++ = 0;                                                      // terminate
      *(mDma2dCurBuf-7) = 2;                                                    // stamp opCode

      if (mDma2dCurBuf > mDma2dHighWater)
        mDma2dHighWater = mDma2dCurBuf;
      }

    else {
      DMA2D->FGCOLR = col;
      DMA2D->OMAR   = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
      DMA2D->BGMAR  = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
      DMA2D->OOR    = getWidth() - xlen;
      DMA2D->BGOR   = getWidth() - xlen;
      DMA2D->NLR    = (xlen << 16) | ylen;
      DMA2D->FGMAR  = (uint32_t)src;
      DMA2D->CR = DMA2D_CR_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
      while (!(DMA2D->ISR & DMA2D_ISR_TCIF)) {}
      DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                     DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
      }
    }
  }
//}}}

//{{{
void cLcd::send() {

  // send first opCode using IRQhandler
  if (mBuffered)
    LCD_DMA2D_IRQHandler();
  }
//}}}
//{{{
void cLcd::wait() {

  if (mBuffered) {
    if (osSemaphoreWait (mDma2dSem, 500) != osOK)
      mDma2dTimeouts++;

    // zero out first opcode, point past it
    mDma2dCurBuf = mDma2dBuf;
    *mDma2dCurBuf++ = 0;
    }
  }
//}}}
//{{{
void cLcd::sendWait() {

  send();
  wait();
  }
//}}}

//{{{
void cLcd::reset() {

  for (auto i = 0; i < mMaxLine; i++)
    mLines[i].clear();

  mStartTime = osKernelSysTick();
  mLastLine = -1;
  mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::displayTop() {
  mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::displayTail() {

  if (mLastLine > (int)mNumDrawLines-1)
    mFirstLine = mLastLine - mNumDrawLines + 1;
  else
    mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::updateNumDrawLines() {

  mStringPos = getLineHeight()*3;

  auto numDrawLines = getHeight() / getLineHeight();
  if (mShowTitle && !mTitle.empty())
    numDrawLines--;
  if (mShowLcdStats)
    numDrawLines--;
  if (mShowFooter)
    numDrawLines--;

  mNumDrawLines = numDrawLines;
  }
//}}}
